Repository: asv-soft/asv-drones
Catalog: src/Asv.Drones/RS.*.resx
Languages: ru

# ParametersEditorPageView_StarsToggleButton_ToolTip
source: Show only starred parameters
ru: Показать только избранные параметры

# ParametersEditorPageView_UpdateButton_ToolTip
source: Update all parameters
ru: Обновить все параметры

# ParametersEditorPageView_PinsOffButton_ToolTip
source: Remove all pinned parameters
ru: Убрать все прикреплённые параметры

# ParametersEditorPageViewModel_Search
source: Search
ru: Найти

# ParametersEditorPageViewModel_Total
source: Total: {0}
ru: Всего: {0}

# ParametersEditorPageView_StarButton_ToolTip
source: Star this parameter
ru: Добавить параметр в избранные

# ParamPageViewModel_DataLossDialog_Content
source: You have unsaved changes. Do you want to save them?
ru: У вас есть несохраненные данные. Хотите сохранить их?

# ParamPageViewModel_DataLossDialog_Title
source: Potential data loss warning
ru: Предупреждение о возможной потере данных

# ParamPageViewModel_DataLossDialog_PrimaryButtonText
source: Save
ru: Сохранить

# ParamPageViewModel_DataLossDialog_SecondaryButtonText
source: Don't save
ru: Не сохранять

# ParamPageViewModel_DataLossDialog_CloseButtonText
source: Cancel
ru: Отмена

# Unit_Byte_Abbreviation
source: byte
ru: байт

# Unit_Gigabyte_Abbreviation
source: GB
ru: ГБ

# Unit_Kilobyte_Abbreviation
source: KB
ru: КБ

# Unit_Megabyte_Abbreviation
source: MB
ru: МБ

# Unit_Terabyte_Abbreviation
source: TB
ru: ТБ

# FileBrowserViewModel_UploadingDialog_Title
source: Uploading
ru: Выгрузка

# FileBrowserViewModel_UploadingDialog_Message
source: Do you want to upload file '{0}' to device?
ru: Вы хотите загрузить файл '{0}' на устройство?

# FileBrowserViewModel_DownloadDialog_Title
source: Download
ru: Загрузка

# FileBrowserViewModel_DownloadDialog_Message
source: Do you want to download file '{0}'?
ru: Вы хотите скачать файл '{0}'?

# FileBrowserViewModel_FileDownloadedSuccessfully
source: File downloaded successfully: {0}
ru: Файл успешно загружен: {0}

# FileBrowserViewModel_RemoveDialog_Title
source: Remove
ru: Удаление

# FileBrowserViewModel_RemoveDialog_Message
source: Do you want to remove the item?
ru: Вы хотите удалить элемент?

# FileBrowserViewModel_BurstDownloadDialog_Title
source: Burst download
ru: Загрузка (пакетная)

# FileBrowserViewModel_BurstDownloadDialog_PrimaryButtonText
source: Download
ru: Загрузить

# FileBrowserViewModel_BurstDownloadDialog_SecondaryButtonText
source: Cancel
ru: Отмена

# MavParamsPageViewModel_DeviceName_Unknown
source: Unknown
ru: Неизвестно

# FileBrowserView_Watermark_Local
source: Local Search
ru: Локальный поиск

# FileBrowserView_Watermark_Remote
source: Remote Search
ru: Удалённый поиск

# FileBrowserView_Button_Download_Content
source: Download
ru: Загрузить

# FileBrowserView_Button_BurstDownload_Content
source: Burst download
ru: Загрузить (пакетами)

# NotANumber
source: N/A
ru: Н/Д

# MissionProgressView_HomeDistance
source: Home
ru: Стартовая точка

# MissionProgressView_MissionDistanceRTT
source: Mission
ru: Миссия

# MissionProgressView_SubStatusText
source: before complete
ru: до завершения

# MissionProgressView_TargetDistance
source: Target
ru: Цель

# MissionProgressView_Title
source: Mission progress
ru: Прогресс миссии

# MissionProgressView_TotalDistanceRTT
source: Total
ru: Общая дистанция

# MissionProgressView_DownLoadingMission
source: Downloading mission
ru: Загрузка миссии

# UavAction_AutoMode_Name
source: Auto mode
ru: Авто режим

# UavAction_GuidedMode
source: Guided mode
ru: Ручной режим

# UavAction_Land
source: Land
ru: Посадка

# UavAction_Rtl_Name
source: RTL
ru: Домой

# UavAction_StartMission
source: Start Mission
ru: Начать миссию

# UavAction_TakeOff
source: TakeOff
ru: Взлететь

# UavRttItem_Altitude
source: Altitude
ru: Высота

# UavRttItem_Azimuth
source: Azimuth
ru: Азимут

# UavRttItem_Battery
source: Battery
ru: Батарея

# UavRttItem_GNSS
source: GNSS
ru: ГНСС

# UavRttItem_Link
source: Link
ru: Связь с НСУ

# UavRttItem_Mode
source: Mode
ru: Режим

# UavRttItem_Velocity
source: Velocity
ru: Скорость

# UavWidgetViewModel_StatusText_PullUp
source: Pull Up
ru: Наберите высоту

# UavWidgetViewModel_StatusText_Armed
source: Armed
ru: Разблокировано

# UavWidgetViewModel_StatusText_DisArmed
source: Disarmed
ru: Заблокировано

# FlightPageViewModel_Title
source: Flight
ru: Полет

# UavAction_TakeOff_Description
source: Start takeoff
ru: Начать взлёт

# UavAction_Rtl_Description
source: Return to launch
ru: Возврат на точку запуска

# UavAction_AutoMode_Description
source: Set an Auto mode. Use it to continue mission after interrupt
ru: Автоматический режим. Используйте для продолжения миссии после прерывания

# UavAction_Land_Description
source: Immediately Land
ru: Незамедлительная посадка

# UavAction_GuidedMode_Description
source: Set a Guided mode
ru: Устанавливает ручной режим

# GpsFixType_GpsFixType2dFix
source: 2D position Fix
ru: 2Д позиция Фикс

# GpsFixType_GpsFixType3dFix
source: 3D position Fix
ru: 3Д позиция Фикс

# GpsFixType_GpsFixTypeDgps
source: DGPS/SBAS
ru: DGRS/SBAS

# GpsFixType_GpsFixTypeNoGps
source: No GPS connected
ru: Нет подключения

# GpsFixType_GpsFixTypePpp
source: PPP 3D position
ru: PPP 3Д позиция

# GpsFixType_GpsFixTypeRtkFixed
source: Rtk Fixed
ru: RTK фиксированный

# GpsFixType_GpsFixTypeRtkFloat
source: RTK Float
ru: RTK свободный

# GpsFixType_GpsFixTypeStatic
source: Static Fix
ru: Статичный

# UavAction_StartMission_Description
source: Begins uploaded mission
ru: Запуск ранее загруженной миссии

# SetAltitudeDialogViewModel_ApplyDialog_SecondaryButton_Cancel
source: Cancel
ru: Отмена

# SetAltitudeDialogViewModel_ApplyDialog_PrimaryButton_TakeOff
source: Take off
ru: Взлететь

# MissionProgressViewModel_MissionFlightTime_Symbol
source: min
ru: мин

# UnpinAllParamsCommand_CommandInfo_Name
source: Unpin all params
ru: Снять пины со всех параметров

# WriteParamCommand_CommandInfo_Description
source: Command that writes the param to the mavlink device
ru: Команда записывает параметр в мавлинк устройство

# WritePatamCommand_CommandInfo_Name
source: Write param
ru: Записать параметр

# UnpinAllParamsCommand_CommandInfo_Description
source: Command removes all pinned items from the params page
ru: Команда снимает пины со всех параметров на странице параметров

# StopUpdateParamsCommand_CommandInfo_Description
source: Command to stop receiving parameters from the mavlink device
ru: Команда останавливает получение параметров с устройства мавлинк

# StopUpdateParamsCommand_CommandInfo_Name
source: Stop refreshing params
ru: Остановить получение параметров

# UpdateParamsCommand_CommandInfo_Name
source: Refresh params
ru: Обновить параметры

# UpdateParamsCommand_CommandInfo_Description
source: Command that refreshes params from the mavlink device
ru: Команда обновляет параметры с устройства мавлинк

# ReadParamCommand_CommandInfo_Name
source: Update param
ru: Обновить параметр

# ReadParamCommand_CommandInfo_Description
source: Command that updates param from the mavlink device
ru: Команда обновляет один параметр с устройства мавлинк

# OpenMavParamsCommand_CommandInfo_Name
source: Open mavlink params
ru: Открыть параметры устройства мавлинк

# OpenMavParamsCommand_CommandInfo_Description
source: Command opens mavlink params editor
ru: Команда открывает реадактор мавлинк параметров

# HomePageParamsDeviceItemAction_ActionViewModel_Header
source: Params editor
ru: Редактор параметров

# HomePageParamsDeviceItemAction_ActionViewModel_Description
source: Edit mavlink device parameters
ru: Изменить параметры мавлинк устройства

# PacketViewerViewModel_SavePacketMessagesDialog_Title
source: Select Separator:
ru: Выберите разделитель:

# SavePacketMessagesDialogView_Separator_Tab
source: TAB
ru: Табуляция

# PacketViewerView_ToolTip_Save
source: Save
ru: Сохранить

# PacketViewerView_ToolTip_ClearAll
source: Clear All
ru: Очистить все

# PacketViewerView_ToolTip_PlayPause
source: PLAY/PAUSE
ru: ЗАПУСТИТЬ/ОСТАНОВИТЬ

# PacketMessageViewModel_CsvColumn_Date
source: Date
ru: Дата

# PacketMessageViewModel_CsvColumn_Message
source: Message
ru: Сообщение

# PacketMessageViewModel_CsvColumn_Source
source: Source
ru: Источник

# PacketMessageViewModel_CsvColumn_Type
source: Type
ru: Тип

# PacketViewerView_ExpanderFilterBySources_Header
source: Sources
ru: Источники

# PacketViewerView_ExpanderFilterByTypes_Header
source: Types
ru: Типы

# PacketViewerView_Filters_CheckAll
source: Check All
ru: Выбрать все

# PacketViewerViewModel_SavePacketMessagesDialog_CloseButtonText
source: Cancel
ru: Отменить

# PacketViewerViewModel_SavePacketMessagesDialog_PrimaryButtonText
source: Accept
ru: Подтвердить

# FileBrowserViewModel_RenameDialog_Title
source: Rename
ru: Переименовать

# FileBrowserViewModel_RenameDialog_PrimaryButtonText
source: Accept
ru: Подтвердить

# FileBrowserViewModel_RenameDialog_SecondaryButtonText
source: Cancel
ru: Отменить

# FileBrowserViewModel_RenameDialog_Message
source: Input new name
ru: Введите новое имя

# OpenFlightModeCommand_CommandInfo_Name
source: Open flight mode
ru: Открыть режим полета

# OpenFlightModeCommand_CommandInfo_Description
source: Command that opens flight mode page
ru: Команда, которая открывает страницу режима полета

# OpenFileBrowserCommand_CommandInfo_Name
source: Open file browser
ru: Открыть браузер файлов

# OpenFileBrowserCommand_CommandInfo_Description
source: Command that opens file browser
ru: Команда открывает файл браузер

# OpenPacketViewerCommand_CommandInfo_Name
source: Open packet viewer
ru: Открыть просмотр пакетов

# OpenPacketViewerCommand_CommandInfo_Description
source: Command that opens packet viewer
ru: Команда открывает просмотр пакетов

# AltitudeIndicatorStyles_ToolTip_Velocity
source: Velocity
ru: Скорость

# AltitudeIndicatorStyles_ToolTip_Altitude
source: Altitude
ru: Высота

# AltitudeIndicatorStyles_ToolTip_Compass
source: Compass
ru: Компас

# AltitudeIndicatorStyles_ToolTip_Vibration
source: Vibration
ru: Вибрация

# FileBrowserViewModel_Title
source: Browser
ru: Браузер

# UavWidgetViewModel_SetAltitudeDialog_Title
source: Input Altitude
ru: Введите высоту

# MavParamsPageView_AwaitingScreen_Header
source: Connecting
ru: Подключение

# MavParamsPageView_AwaitingScreen_Description
source: Connecting to the device...
ru: Подключение к устройству...

# MavParamsPageView_CancelButton_Content
source: Cancel
ru: Отмена

# MavParamsPageView_Loading_Text
source: Loading
ru: Загрузка...

# PacketViewerViewModel_Title
source: Packet Viewer
ru: Просмотр пакетов

# MavParamsPageViewModel_Title
source: Params
ru: Параметры

# RenameItemCommand_CommandInfo_Name
source: Commit item rename
ru: Подтвердить переименование элемента

# RenameItemCommand_CommandInfo_Description
source: Command that commits an item renaming
ru: Команда, которая подтверждает переименование элемента

# ClearAllPacketsCommand_CommandInfo_Name
source: Clear all packets
ru: Очистить все пакеты

# ClearAllPacketsCommand_CommandInfo_Description
source: Command that clears all packets
ru: Команда, которая очищает все пакеты

# ExportPacketsToCsvCommand_CommandInfo_Name
source: Export packets to CSV
ru: Экспортировать пакеты в CSV файл

# ExportPacketsToCsvCommand_CommandInfo_Description
source: Command that exports packets to a CSV file
ru: Команда экспортирует пакеты в файл с CSV расширением

# FileBrowserView_AwaitingScreen_Description
source: Connect to the device's FTP service...
ru: Подключение к FTP сервису устройства...

# FileBrowserView_AwaitingScreen_Header
source: Connecting
ru: Подключение

# RemoveItemCommand_CommandInfo_Name
source: Remove item
ru: Удалить элемент

# RemoveItemCommand_CommandInfo_Description
source: Command that removes item
ru: Команда, которая удаляет элемент

# CalculateCrc32Command_CommandInfo_Description
source: Command that checks a cyclic redundancy of a file (crc32)
ru: Команда, которая проверяет циклическую избыточность файла (crc32)

# CalculateCrc32Command_CommandInfo_Name
source: Calculate CRC32
ru: Рассчитать CRC32

# CreateDirectoryCommand_CommandInfo_Name
source: Create a folder
ru: Создать папку

# CreateDirectoryCommand_CommandInfo_Description
source: Command that creates a folder
ru: Команда, которая создаёт папку

# BurstDownloadItemCommand_CommandInfo_Name
source: Burst-Download
ru: Загрузить (пакетами)

# BurstDownloadItemCommand_CommandInfo_Description
source: Command that download an element by burst
ru: Команда, которая загружает элемент пакетами

# DownloadItemCommand_CommandInfo_Name
source: Download
ru: Загрузка

# DownloadItemCommand_CommandInfo_Description
source: Command that downloads remote entries
ru: Команда, которая загружает удалённые элементы

# UploadItemCommand_CommandInfo_Name
source: Upload
ru: Отгрузка

# UploadItemCommand_CommandInfo_Description
source: Command that uploads files to the remote device
ru: Команда, которая отгружает файлы на удалённое устройство

# FindFileOnLocalCommand_CommandInfo_Name
source: Find file
ru: Найти файл

# FindFileOnLocalCommand_CommandInfo_Description
source: Command that finds a file selected in a remote tree in a local tree
ru: Команда, которая находит файл, выбранный в удаленном дереве, в локальном дереве

# SetupPageViewModel_Title
source: Setup
ru: Настройка

# SetupFrameTypeViewModel_Name
source: Frame type
ru: Тип рамы

# ChangeFrameTypeCommand_CommandInfo_Description
source: Command that changes frame type
ru: Команда, которая изменяет тип рамы

# ChangeFrameTypeCommand_CommandInfo_Name
source: Change frame type
ru: Изменить тип рамы

# SetupFrameTypeView_Loader_Header
source: Loading...
ru: Загрузка...

# SetupFrameTypeView_Loader_Description
source: Please wait
ru: Пожалуйста, подождите

# SetupFrameTypeView_ApplyFrame
source: Set
ru: Установить

# SetupFrameTypeView_FrameMetadata
source: Metadata
ru: Мета-данные

# SetupFrameTypeView_CurrentFrame
source: Current frame
ru: Текущая рама

# SetupFrameTypeViewModel_ApplyConfirmation_Title
source: Change frame type
ru: Смена типа рамы

# SetupFrameTypeViewModel_ApplyConfirmation_Message
source: Do you want to change frame type?
ru: Вы хотите сменить тип рамы?

# SetupFrameTypeViewModel_CurrentFrame_Unknown
source: Unknown
ru: Неизвестно

# OpenSetupCommand_CommandInfo_Name
source: Open Setup page
ru: Открыть страницу настройки

# OpenSetupCommand_CommandInfo_Description
source: Command that opens setup page for the drone
ru: Команда открывает страницу для настройки дрона

# SetupFrameTypeView_CurrentFrame_Refresh
source: Refresh current frame
ru: Обновить текущую раму

# SetupFrameTypeView_CurrentFrame_Meta
source: Description
ru: Описание

# MissionProgressView_RefreshButton_Text
source: Refresh mission
ru: Обновить миссию

# MissionProgressView_DownloadButton_Text
source: Download Mission
ru: Скачать миссию

# SetupMotorsView_TestDuration
source: Duration
ru: Время теста

# SetupMotorsView_DurationLabel_TimeUnit
source: s
ru: сек

# MotorItemView_Label_MotorId
source: Motor
ru: Мотор

# MotorItemView_MonitoringLabel_Servo
source: Servo
ru: Сервопривод

# MotorItemView_MonitoringLabel_Pwm
source: PWM
ru: ШИМ

# MotorItemView_ToolTip_StartStop
source: START/STOP
ru: ЗАПУСТИТЬ/ОСТАНОВИТЬ

# SetupMotorsViewModel_Name
source: Motor Test
ru: Тест моторов
