Repository: asv-soft/asv-drones
Catalog: src/Asv.Drones.Gui.Sdr/RS.*.resx
Languages: ru

# SdrRttItem_ValueNotAvailable
source: N\A
ru: Н\Д

# LinkQualitySdrRttView_ToolTip
source: SDR link quality
ru: Качество связи с SDR

# SdrRttViewModel_Rf_Header
source: RF
ru: ВЧ

# LlzSdrRttViewModel_Crs_Header
source: CRS
ru: Узкий

# LlzSdrRttViewModel_Clr_Header
source: CLR
ru: Широкий

# SdrRttViewModel_Main_Header
source: Main
ru: Суммарный

# SdrRttViewModel_SumPower_Title
source: Sum
ru: Сум.

# LlzSdrRttViewModel_AM_90_Hz_Title
source: AM 90 Hz
ru: АМ 90 Гц

# LlzSdrRttViewModel_AM_150_Hz_Title
source: AM 150 Hz
ru: АМ 150 Гц

# SdrRttViewModel_ID_Code_Title
source: ID Code
ru: Код СО

# LlzSdrRttViewModel_Freq_90_Hz_Title
source: Freq 90 Hz
ru: Частота 90 Гц

# LlzSdrRttViewModel_Freq_150_Hz_Title
source: Freq 150 Hz
ru: Частота 150 Гц

# LlzSdrRttViewModel_CRSPower_Title
source: CRS
ru: Узк.

# LlzSdrRttViewModel_CLRPower_Title
source: CLR
ru: Шир.

# LlzSdrRttViewModel_DDM_Title
source: DDM
ru: РГМ

# LlzSdrRttViewModel_SDM_Title
source: SDM
ru: СГМ

# VorSdrRttViewModel_Main_Header
source: Main
ru: Общие

# VorSdrRttViewModelPowerTitle
source: Lev
ru: Ур.

# VorSdrRttViewModelBearingTitle
source: Bearing
ru: Азимут

# VorSdrRttViewModelAM30HzTitle
source: AM 30 Hz
ru: АМ 30 Гц

# VorSdrRttViewModelAM9960HzTitle
source: AM 9960 Hz
ru: АМ 9960 Гц

# VorSdrRttViewModelFMDeviationTitle
source: FM-Deviation
ru: Отклонение ЧМ

# VorSdrRttViewModelVoiceAmTitle
source: Voice AM
ru: АМ голоса

# VorSdrRttViewModelFreq30HzTitle
source: Freq 30 Hz
ru: Частота 30 Гц

# VorSdrRttViewModelFreq9960HzTitle
source: Freq 9960 Hz
ru: Частота 9960 Гц

# VorSdrRttViewModelFreqFM30Title
source: Freq FM 30
ru: ЧМ част. 30

# VorSdrRttViewModelFMIndexTitle
source: FM Index
ru: Индекс ЧМ

# FlightSdrView_SystemControlAction_Reboot_Title
source: Reboot OS
ru: Перезагрузить ОС

# FlightSdrView_SystemControlAction_Shutdown_Title
source: Shutdown OS
ru: Выключить ОС

# LlzSdrRttViewModelChannelTitle
source: Ch.
ru: Кан.

# LlzSdrRttViewModel_FieldStrength_Title
source: Field strength
ru: Напр. поля

# LlzSdrRttViewModel_MainFrequency_Title
source: Freq.
ru: Част.

# LlzSdrRttViewModel_MeasureTime_Title
source: MTime
ru: Вр. изм.

# VorSdrRttViewModel_MeasureTime_Title
source: MTime
ru: Вр. изм.

# VorSdrRttViewModel_MainFrequency_Title
source: Freq.
ru: Част.

# VorSdrRttViewModel_FieldStrength_Title
source: Field strength
ru: Напр. поля

# VorSdrRttViewModelChannelTitle
source: Ch.
ru: Кан.

# LLzSdrRttViewModel_ValueNotAvailable
source: N\A
ru: Н\Д

# LLzSdrRttViewModel_MeasureTime_Units
source: ms
ru: мс

# LLzSdrRttViewModel_FieldStrength_Units
source: μV/m
ru: μВ/м

# VorSdrRttViewModel_MeasureTime_Units
source: ms
ru: мс

# VorSdrRttViewModel_FieldStrength_Units
source: μV/m
ru: μВ/м

# FlightSdrViewModel_Frequency_Validation_ErrorMessage
source: Value must be greater than 0
ru: Значение должно быть больше 0

# FlightSdrViewModel_UpdateMode_Error_Sender
source: Set mode
ru: Установить режим

# FlightSdrViewModel_UpdateMode_Error_Message
source: Error to set payload mode
ru: Ошибка при установке режима полезной нагрузки

# FlightSdrViewModel_RecordStartDialog_PrimarryButton_Name
source: Start
ru: Начать

# FlightSdrViewModel_RecordStartDialog_SecondaryButton_Name
source: Cancel
ru: Отмена

# FlightSdrViewModel_RecordStartDialog_Title
source: New
ru: Новая запись

# FlightSdrViewModel_StartRecord_Error_Message
source: Error to set payload mode
ru: Ошибка при установке режима полезной нагрузки

# FlightSdrViewModel_StopRecord_Error_Message
source: Error to set payload mode
ru: Ошибка при установке режима полезной нагрузки

# FlightSdrViewModel_StartRecord_Error_Sender
source: Rec start
ru: Начать запись

# FlightSdrViewModel_StopRecord_Error_Sender
source: Rec stop
ru: Остановить запись

# RecordStartViewModel_TagName_Validation_ErrorMessage
source: Not valid tag name
ru: Некорректное имя тэга

# RecordStartViewModel_TagValue_Float64_ErrorMessage
source: This is not valid Float64 value!
ru: Это недопустимое значение Float64!

# RecordStartViewModel_TagValue_Int64_ErrorMessage
source: This is not valid Int64 value!
ru: Это недопустимое значение Int64!

# RecordStartViewModel_TagValue_UInt64_ErrorMessage
source: This is not valid UInt64 value!
ru: Это недопустимое значение UInt64!

# RecordStartViewModel_TagValue_String8_ErrorMessage
source: String length must be < 9, and contain only ascii-chars!
ru: Длина строки должна быть < 9 и содержать только символы ascii!

# RecordStartViewModel_RecordName_Validation_ErrorMessage
source: Not valid record name
ru: Недопустимое имя записи

# RecordStartView_RecordName_Title
source: Record name (required)
ru: Имя записи (обязательно)

# RecordStartView_RecordName_Watermark
source: Enter new record name
ru: Введите имя для новой записи

# RecordStartView_AddButton_Title
source: Add
ru: Добавить

# RecordStartView_TagName_Watermark
source: Enter new tag name
ru: Введите имя для нового тэга

# RecordStartView_TagValue_Watermark
source: Enter new tag value
ru: Введите значение для нового тэга

# SdrStoreEntityViewModel_DeleteDialog_Title
source: Confirm delete
ru: Подтвердите удаление

# SdrStoreEntityViewModel_DeleteDialog_SecondaryButton
source: Cancel
ru: Отмена

# SdrStoreEntityViewModel_DeleteDialog_PrimaryButton
source: Delete
ru: Удалить

# SdrStoreEntityViewModel_DeleteDialog_Content
source: Are you sure you want to delete "{0}"?
ru: Вы уверены что хотите удалить "{0}"?

# SdrStoreEntityViewModel_MoveDialog_Title
source: Change location
ru: Изменить расположение

# SdrStoreEntityViewModel_MoveDialog_PrimaryButton
source: Move
ru: Переместить

# SdrStoreEntityViewModel_MoveDialog_SecondaryButton
source: Cancel
ru: Отмена

# SdrStoreBrowserViewModel_TotalFileSamples
source: Total samples: {0}
ru: Всего записей: {0}

# SdrStoreBrowserViewModel_TotalFileSize
source: File size: {0}
ru: Размер файла: {0}

# SdrStoreBrowserViewModel_SearchWatermark
source: Search
ru: Искать

# SdrStoreEntityViewModel_Name_Validation_ErrorMessage
source: Not valid record name
ru: Недопустимое имя записи

# RecordStartView_RecordTags_Title
source: Record tags (optional)
ru: Теги записи (опционально)

# SdrSettingsViewModel_Header
source: SDR settings
ru: Настройки SDR

# SdrSettingsViewModel_Description
source: In this section, you can configure various SDR parameters.
ru: В этом разделе можно настроить различные параметры SDR.

# SdrSettingsViewModel_DefaultFreqs_Title
source: Default frequencies
ru: Частоты по умолчанию

# SdrSettingsViewModel_VorFreq_Header
source: VOR frequency
ru: Частота VOR

# SdrSettingsViewModel_VorFreq_Description
source: In this section you can configure the default VOR frequency.
ru: В этом разделе можно настроить частоту VOR по умолчанию.

# SdrSettingsViewModel_LlzFreq_Header
source: LLZ frequency
ru: Частота LLZ

# SdrSettingsViewModel_LLzFreq_Description
source: In this section you can configure the default LLZ frequency.
ru: В этом разделе можно настроить частоту LLZ по умолчанию.

# SdrSettingsViewModel_GpFreq_Header
source: GP frequency
ru: Частота GP

# SdrSettingsViewModel_GpFreq_Description
source: In this section you can configure the default GP frequency.
ru: В этом разделе можно настроить частоту GP по умолчанию.

# SdrSettingsViewModel_DataThinning_Header
source: Data thinning
ru: Прореживание данных

# SdrSettingsViewModel_DataThinning_Description
source: In this section you can configure the default data thinning frequency.
ru: В этом разделе можно настроить частоту прореживания данных по умолчанию.

# SdrSettingsViewModel_FileWriteFreq_Header
source: Frequency of writing to file
ru: Частота записи в файл

# SdrSettingsViewModel_FileWriteFreq_Description
source: In this section you can configure the default frequency of writing to file.
ru: В этом разделе можно настроить частоту записи в файл по умолчанию.

# SdrSettingsViewModel_DefaultChannels_Title
source: Default channels
ru: Каналы по умолчанию

# SdrSettingsViewModel_LLzChannel_Description
source: In this section you can configure the default LLZ channel.
ru: В этом разделе можно настроить канал LLZ по умолчанию.

# SdrSettingsViewModel_LlzChannel_Header
source: LLZ channel
ru: Канал LLZ

# SdrSettingsViewModel_VorChannel_Header
source: VOR channel
ru: Канал VOR

# SdrSettingsViewModel_VorChannel_Description
source: In this section you can configure the default VOR channel.
ru: В этом разделе можно настроить канал VOR по умолчанию.
