Repository: asv-soft/asv-drones
Catalog: src/Asv.Drones.Gui/RS.*.resx
Languages: ru

# FlightShellMenuItem_Name
source: Flight mode
ru: Режим полета

# ThemeService_Themes_Contrast
source: Contrast
ru: Контрастная

# ThemeService_Themes_Dark
source: Dark
ru: Темная

# ThemeService_Themes_Light
source: Light
ru: Светлая

# ThemeService_FlowDirections_LeftToRight
source: LeftToRight
ru: СлеваНаПраво

# ThemeService_FlowDirections_RightToLeft
source: RightToLeft
ru: СправаНаЛево

# SettingsThemeViewModel_CurrentTheme
source: Theme
ru: Тема

# SettingsThemeViewModel_ChangeThemeDescription
source: Change the current application theme.
ru: Измените текущую тему приложения.

# SettingsThemeViewModel_CurrentLanguage
source: Language
ru: Язык приложения

# SettingsThemeViewModel_CurrentLanguageDescription
source: Change the current application language. The changes will be applied after a restart.
ru: Измените текущий язык приложения. Изменения будут применены после перезапуска приложения.

# SettingsThemeViewModel_FlowDirection
source: Flow direction
ru: Направление чтения

# SettingsThemeViewModel_FlowDirectionDescription
source: Change the current application flow direction.
ru: Измените направление чтения.

# PlaningShellMenuItem_Name
source: Mission planing
ru: Планирование полета

# ByteSize_BytesUnit
source: B
ru: Б

# ByteSize_KilobytesUnit
source: KB
ru: КБ

# ByteSize_MegabytesUnit
source: MB
ru: МБ

# ByteSize_GigabytesUnit
source: GB
ru: ГБ

# Common_NotAvailable
source: N/A
ru: Н/Д

# BytesRate_BytesPerSecondUnit
source: B/s
ru: Б/с

# BytesRate_GigaBytesPerSecondUnit
source: GB/s
ru: ГБ/с

# BytesRate_KiloBytesPerSecondUnit
source: KB/s
ru: КБ/с

# BytesRate_MegaBytesPerSecondUnit
source: MB/s
ru: МБ/с

# ItemsRate_GigaHerzUnit
source: GHz
ru: ГГц

# ItemsRate_HerzUnit
source: Hz
ru: Гц

# ItemsRate_KiloHerzUnit
source: KHz
ru: КГц

# ItemsRate_MegaHerzUnit
source: MHz
ru: МГц

# SettingsView_RebootRequiredTitle
source: Reboot required
ru: Требуется перезагрузка

# SettingsView_RebootRequiredDescription
source: You must reload the program to apply the changes.
ru: Вы должны перезагрузить программу, чтобы применить изменения.

# MeasureUnitsSettingsViewModel_Distance
source: Distance
ru: Расстояние

# MeasureUnitsSettingsViewModel_DistanceDescription
source: Change the current measure units of distance.
ru: Измените текущие единицы измерения расстояния.

# MeasureUnitsSettingsViewModel_Altitude
source: Altitude
ru: Высота

# MeasureUnitsSettingsViewModel_AltitudeDescription
source: Change the current measure units of altitude.
ru: Измените текущие единицы измерения высоты.

# MeasureUnitsSettingsViewModel_Latitude
source: Latitude
ru: Широта

# MeasureUnitsSettingsViewModel_LatitudeLongitudeDescription
source: Change the current measure units of latitude & longitude.
ru: Измените текущие единицы измерения широты и долготы.

# MeasureUnitsSettingsViewModel_DistanceMeters
source: Meters
ru: Метры

# MeasureUnitsSettingsViewModel_DistanceInternationalNauticalMiles
source: Nautical miles
ru: Морские мили

# Altitude_Meter_Title
source: Meters
ru: Метры

# Altitude_Feet_Title
source: Feets
ru: Футы

# MeasureUnitsSettingsViewModel_LatitudeLongtitudeDegrees
source: Degrees
ru: Градусы

# MeasureUnitsSettingsViewModel_LatitudeLongtitudeDegreesMinutesSeconds
source: Degrees, minutes, seconds
ru: Градусы, минуты, секунды

# Altitude_Feet_Unit
source: ft
ru: фут

# Altitude_Meter_Unit
source: m
ru: м

# Distance_Meters_Unit
source: m
ru: м

# Velocity_MetersPerSecondUnit
source: m/s
ru: м/с

# Velocity_KilometersPerHourUnit
source: km/h
ru: км/ч

# Velocity_MilesPerHourUnit
source: mi/h
ru: миль/ч

# RelativeTime_MillisecondsUnit
source: ms
ru: мс

# RelativeTime_SecondsUnit
source: s
ru: с

# MeasureUnitsSettingsViewModel_MeasurementUnits_Header_Title
source: Measurement units
ru: Единицы измерения

# MeasureUnitsSettingsViewModel_MeasurementUnits_Header_Description
source: In this section you can specialize measurement units for various parameters.
ru: В этом разделе можно настроить единицы измерения для различных параметров.

# MeasureUnitsSettingsViewModel_Velocity
source: Velocity
ru: Скорость

# MeasureUnitsSettingsViewModel_VelocityDescription
source: Change the current measure units of velocity.
ru: Измените текущие единицы измерения скорости.

# HeaderToolsMenu_Header
source: Tools
ru: Инструменты

# HeaderCoordinatesCalculatorMenu_Header
source: Coordinates calculator
ru: Калькулятор координат

# SettingsShellMenuProvider_SettingsShellMenuProvider_Settings
source: Settings
ru: Настройки

# MapSettingsView_MapProvider_Description
source: Select current map provider
ru: Выбрать провайдер карт

# MapSettingsView_MapProvider_Header
source: Map Provider
ru: Провайдер карт

# MapSettingsView_MapsInfo_ButtonTitle
source: Clear storage
ru: Очистить хранилище

# MapSettingsView_MapsInfo_Description
source: Current map storage is located at {0} and has a size of {1}
ru: Текущее хранилище карт находится {0} и занимает {1}

# MapSettingsView_MapsInfo_Header
source: Map storage
ru: Хранилище карт

# MapSettingsViewModel_MapDialogTitle
source: Maps
ru: Карты

# Distance_Meters_Title
source: Meters
ru: Метры

# GlobalCommands_OpenStoreDialogTitle
source: Open store file
ru: Открыть файл

# Distance_NauticalMiles_Title
source: Nautical miles
ru: Морские мили

# LogMessagesShellMenuItem_Name
source: Log messages
ru: Сообщения лога

# LogMessagesPageView_By
source: by
ru: по

# LogMessagesPageView_SearchWatermark
source: Search
ru: Найти

# LogMessagesPageView_From
source: From {0}
ru: От {0}

# LogMessagesPageView_To
source: to {0}
ru: до {0}

# LogMessagesPageView_Filtered
source: Filtered: {0}
ru: Фильтрованных: {0}

# LogMessagesPageView_Total
source: Total: {0}
ru: Всего: {0}

# LogMessagesPageViewModel_LogName
source: LogMessages
ru: СообщенияЛога

# LogMessagesPageViewModel_RefreshErrorMessage
source: Error to refresh items
ru: Ошибка при обновлении элементов

# LogMessagesPageViewModel_ClearAllMessage
source: Clear all log messages
ru: Очистить все сообщения лога

# SerialPortViewModel_SerialPortViewModel_You_must_specify_a_valid_name
source: You must specify a valid name
ru: Вы должны указать допустимое имя

# SerialPortViewModel_SerialPortViewModel_ValidSerialPort
source: You must specify a valid serial port name
ru: Вы должны указать действительное имя последовательного порта

# SerialPortViewModel_SerialPortViewModel_BaudRateValid
source: Baud rate must be value from {0} to {1}
ru: Скорость передачи данных должна быть значением от {0} до {1}

# SerialPortViewModel_SerialPortViewModel_NewSerial
source: New serial {0}
ru: Новый последовательный порт {0}

# SerialPortView_Title
source: Port title
ru: Название

# SerialPortView_PortName
source: Port name
ru: Порт

# SerialPortView_BaudRate
source: Baud rate
ru: Скорость порта

# ConnectionsShellMenuItem_Name
source: Connections
ru: Подключения

# ConnectionsViewModel_AddDialogPort_Add
source: Add
ru: Добавить

# ConnectionsViewModel_AddDialogPort_Cancel
source: Cancel
ru: Отмена

# ConnectionsViewModel_AddSerialPortDialog_Title
source: Add new Mavlink serial port
ru: Новый последовательный порт

# ConnectionsViewModel_AddTcpPortDialog_Title
source: Add new Mavlink TCP port
ru: Новый TCP порт

# ConnectionsViewModel_AddUdpPortDialog_Title
source: Add new Mavlink UDP port
ru: Новый порт UDP

# PortView_ToggleButton_Enabled
source: Enabled
ru: Включен

# PortView_ToggleButton_Disabled
source: Disabled
ru: Выключен

# ConnectionsPortsView_AddSerialCommand_Title
source: Add Serial
ru: Новый COM

# ConnectionsPortsView_AddTcpCommand_Title
source: Add TCP
ru: Новый TCP

# ConnectionsPortsView_AddUdpCommand_Title
source: Add UDP
ru: Новый UDP

# ConnectionsPortsView_Header_Title
source: Ports
ru: Порты

# ConnectionsView_Header_Description
source: This page allows you to configure the basic settings on the Mavlink network
ru: Эта страница позволяет настроить основные параметры сети Mavlink

# ConnectionsPortsView_Header_Description
source: Point of entry that allows it to communicate with other devices in Mavlink network.
ru: Точка входа, позволяющая ему общаться с другими устройствами в сети Mavlink.

# ConnectionsView_Header_Title
source: Mavlink network
ru: Сеть Mavlink

# DeviceBrowserView_Description
source: In this section you can see all found devices on the network
ru: В этом разделе можно посмотреть все найденные устройства в сети

# DeviceBrowserView_Header
source: Device list
ru: Список найденных устройств

# ConnectionsIdentificationView_HeartbeatRate_Description
source: The rate at which the HEARTBEAT message must be transmitted to announce the existence of the system on the MAVLink network
ru: Частота, с которой сообщения HEARTBEAT должны передаваться, чтобы объявить о существовании системы в сети MAVLink

# ConnectionsIdentificationView_HeartbeatRate_Header
source: Heartbeat rate
ru: Частота Heartbeat

# ConnectionsIdentificationView_HeartbeatTimeout_Description
source: After that timeout of Heartbeat packet deviceService will be removed from deviceService list
ru: По истечении таймаута пакета Heartbeat устройство будет удалено из списка устройств

# ConnectionsIdentificationView_HeartbeatTimeout_Header
source: Heartbeat timeout
ru: Таймаут Heartbeat

# ConnectionsIdentificationView_SystemComponentId_Description
source: Each system has a network-unique system id, and each component has a system-unique component id that can be used for addressing/routing
ru: Каждая система имеет идентификатор, и каждый компонент имеет идентификатор компонента системы, который можно использовать для адресации/маршрутизации

# ConnectionsIdentificationView_SystemComponentId_Header
source: System \ Component ID
ru: ID Системы \ Компонента

# MavlinkDeviceView_Mode_Name
source: Custom mode
ru: Пользовательский режим

# MavlinkDeviceView_Rate_Name
source: Heartbeat rate
ru: Частота Heartbeat

# MavlinkDeviceView_Status_Name
source: System status
ru: Статус системы

# TcpPortView_TcpIpAddress
source: IP address
ru: IP адрес

# TcpPortView_PortTitle
source: Port title
ru: Название

# TcpPortView_TcpIpPort
source: Port number
ru: Номер порта

# UdpPortView_LocalIpAddress
source: IP Address
ru: IP адрес

# UdpPortView_LocalPortName
source: Port Number
ru: Порт

# UdpPortView_PortTitle
source: Title
ru: Название

# UdpPortView_RemoteIpAddress
source: Remote IP Address
ru: Удаленный IP адрес

# UdpPortView_RemotePortName
source: Remote port number
ru: Удаленный порт

# UdpPortView_ToggleName
source: Specify remote host
ru: Указать удаленный хост

# ConnectionsIdentificationViewModel_DeviceTimeout
source: Timeout must be from {0} to {1}
ru: Таймаут должен быть от {0} до {1}

# ConnectionsIdentificationViewModel_ToString
source: Hz
ru: Гц

# PortViewModel_SkippedUnitTest
source: error
ru: ошибка

# TcpPortViewModel_Title
source: New TCP
ru: Новый TCP

# TcpPortViewModel_ValidTitle
source: You must specify a valid name
ru: Вы должны указать действительное имя

# TcpPortViewModel_ValidPort
source: Port number must be value from 1 to 65535
ru: Номер порта должен иметь значение от 1 до 65535

# TcpPortViewModel_ValidIpAddress
source: You must insert a valid ip address
ru: Вы должны ввести действительный IP-адрес

# TcpPortViewModel_LogService_Error
source: Error to create port
ru: Ошибка при создании порта

# UdpPortViewModel_ValidTitle
source: You must specify a valid name
ru: Вы должны указать действительное имя

# UdpPortViewModel_ValidLocalIpAddress
source: You must enter a valid IP address
ru: Вы должны ввести действительный IP-адрес

# UdpPortViewModel_ValidLocalPort
source: Port number must be a value between 1 and 65535
ru: Номер порта должен иметь значение от 1 до 65535

# UdpPortViewModel_ValidRemotePort
source: Port number must be a value between 1 and 65535
ru: Номер порта должен иметь значение от 1 до 65535

# UdpPortViewModel_ValidRemoteIpAddress
source: You must enter a valid IP address
ru: Вы должны ввести действительный IP-адрес

# UdpPortViewModel_Title
source: New UDP
ru: Новый UDP

# PacketViewerShellMenuItem_Name
source: Packet Viewer
ru: Просмотр пакетов

# LogMessageTypeHelper_GetDisplayName_Info
source: Info
ru: Информация

# LogMessageTypeHelper_GetDisplayName_Warning
source: Warning
ru: Предупреждение

# LogMessageTypeHelper_GetDisplayName_Error
source: Error
ru: Ошибка

# PacketViewerView_CheckAll
source: Check/Uncheck All
ru: Показать/Скрыть все

# PacketViewerView_PlayPause
source: Play/Pause
ru: Возобновить/Остановить

# PacketViewerView_ClearAll
source: Clear all packets
ru: Очистить список пакетов

# PacketViewerView_Save
source: Save as CSV
ru: Сохранить как CSV

# Voltage_Unit
source: V
ru: В

# MeasureUnitsSettingsViewModel_Longitude
source: Longitude
ru: Долгота

# ConnectionsViewModel_EditDialogPort_Accept
source: Accept
ru: Принять

# ConnectionsViewModel_EditSerialPortDialog_Title
source: Edit selected Mavlink serial port
ru: Редактировать выбранный последовательный порт

# ConnectionsViewModel_EditTcpPortDialog_Title
source: Edit selected Mavlink TCP port
ru: Редактировать выбранный TCP порт

# ConnectionsViewModel_EditUdpPortDialog_Title
source: Edit selected Mavlink UDP port
ru: Редактировать выбранный порт UDP

# ConnectionsViewModel_EditDialogPort_Cancel
source: Cancel
ru: Отмена

# LoggerView_ErrorFilter_Name
source: Error
ru: Ошибка

# LoggerView_InfoFilter_Name
source: Info
ru: Инфо

# LoggerView_TraceFilter_Name
source: Trace
ru: Отладка

# LoggerView_WarningFilter_Name
source: Warning
ru: Предупреждение

# LogMessagesPageView_By_ToolTip
source: Number of elements on one page
ru: Число элементов на одной странице

# LogMessagesPageView_ClearAllButton_ToolTip
source: Clear all logs
ru: Очистить логи

# LogMessagesPageView_PrevButton_ToolTip
source: Move to previous page
ru: Перейти к предыдущей странице

# LogMessagesPageView_NextButton_ToolTip
source: Move to next page
ru: Перейти к следующей странице

# LogMessagesPageView_RefreshButton_ToolTip
source: Refresh all elements
ru: Обновить все элементы

# SavedCoordsView_Header
source: Saved Coordinates
ru: Сохраненные координаты

# SavedCoordsView_Description
source: in this section you can view and save new map coordinates for GBS Fixed Mode
ru: В этом разделе вы можете просматривать и добавлять новые точки координат для Fixed режима базовой станции

# SavedCoordsView_AddNewButton_Name
source: Add New
ru: Добавить

# SavedCoordsView_RemoveButton_Name
source: Remove
ru: Удалить

# SavedCoordsViewModel_AddNewItem_CloseButtonText
source: Cancel
ru: Отмена

# SavedCoordsViewModel_AddNewItem_PrimaryButtonText
source: Add
ru: Добавить

# SavedCoordsViewModel_AddNewItem_Title
source: Add new map coordinate
ru: Добавить новую точку на карте

# AddNewMapPointView_Accuracy_Name
source: Accuracy
ru: Точность

# AddNewMapPointView_Altitude_Name
source: Altitude
ru: Высота

# AddNewMapPointView_Latitude_Name
source: Latitude
ru: Широта

# AddNewMapPointView_Longitude_Name
source: Longitude
ru: Долгота

# SavedCoordsViewModel_RemoveItem_Title
source: Remove Map Point
ru: Удалить точку

# SavedCoordsViewModel_RemoveItem_CloseButtonText
source: Cancel
ru: Отмена

# SavedCoordsViewModel_RemoveItem_PrimaryButtonText
source: Remove
ru: Удалить

# RemoveMapPointView_ConfirmationText
source: Are you sure you want to delete this map point?
ru: Уверены что хотите удалить эту точку?

# RemoveMapPointView_Accuracy_Name
source: Accuracy
ru: Точность

# RemoveMapPointView_Altitude_Name
source: Altitude
ru: Высота

# RemoveMapPointView_Latitude_Name
source: Latitude
ru: Широта

# RemoveMapPointView_Longitude_Name
source: Longitude
ru: Долгота

# RemoveMapPointView_Point_Name
source: Name
ru: Имя

# AddNewMapPointView_Point_Name
source: Name
ru: Имя

# AddNewMapPointViewModel_Accuracy_ValidValue
source: Accuracy must be greater or equal {0}.
ru: Точность должна быть больше или равна {0}.

# AddNewMapPointViewModel_Name_ValidValue
source: Name can not be empty
ru: Имя не может быть пустым

# LoggerView_Clear_Name
source: Clear
ru: Очистить

# PacketViewerViewModel_SeparatorDialog_Title
source: Select the separator
ru: Выберите разделитель

# PacketViewerViewModel_SeparatorDialog_DialogPrimaryButton
source: Select
ru: Выбрать

# PacketViewerViewModel_SeparatorDialog_DialogSecondaryButton
source: Cancel
ru: Отмена

# PacketViewerViewModel_SeparatorDialog_Tab
source: Horizontal tabulation [ Tab ]
ru: Горизонтальная табуляция [ Tab ]

# PacketViewerViewModel_SeparatorDialog_Semicolon
source: Semicolon [ ; ]
ru: Точка с запятой [ ; ]

# PacketViewerViewModel_SeparatorDialog_Coma
source: Coma [ , ]
ru: Запятая [ , ]

# MapPageViewModel_RulerStartPoint_Description
source: Select ruler starting point
ru: Укажите начальную точку линейки

# MapPageViewModel_RulerStopPoint_Description
source: Select ruler end point
ru: Укажите конечную точку линейки

# Ddm_InParts_Title
source: In parts
ru: В частях

# Ddm_Percent_Title
source: Percent
ru: Процент

# Ddm_Microamp_Title
source: Microamp
ru: Микроампер

# Ddm_µA_Unit
source: µA
ru: мкА

# Ddm_MicroampRus_Title
source: Microamp (Rus)
ru: Микроампер (Рус)

# MeasureUnitsSettingsViewModel_DdmLlz
source: DDM Llz
ru: РГМ (Курс)

# MeasureUnitsSettingsViewModel_DdmLlzDescription
source: Change the current measure units of DDM Llz.
ru: Измените текущие единицы измерения РГМ (Курс).

# Power_Dbm_Title
source: Decibel to 1 milliwatt
ru: Децибел по отношению к 1 милливатт

# Power_Dbm_Unit
source: dBm
ru: дБм

# AmplitudeModulation_Percent_Title
source: Percents
ru: Проценты

# AmplitudeModulation_InParts_Unit
source: In parts
ru: В частях

# Frequency_Hertz_Title
source: Hertz
ru: Герц

# Frequency_Kilohertz_Title
source: Kilohertz
ru: Килогерц

# Frequency_Megahertz_Title
source: Megahertz
ru: Мегагерц

# Frequency_Gigahertz_Title
source: Gigahertz
ru: Гигагерц

# Frequency_Hertz_Unit
source: Hz
ru: Гц

# Frequency_Kilohertz_Unit
source: kHz
ru: кГц

# Frequency_Megahertz_Unit
source: MHz
ru: МГц

# Frequency_Gigahertz_Unit
source: GHz
ru: ГГц

# Phase_Degree_Title
source: Degrees
ru: Градусы

# Phase_Radian_Title
source: Radian
ru: Радианы

# Phase_Radian_Unit
source: Rad
ru: Рад

# MapSettingsView_MapSettings_Header
source: Map settings
ru: Настройки карты

# MapSettingsView_MapSettings_Description
source: Change current map settings
ru: Изменить текущие настройки карты

# MeasureUnitsSettingsViewModelDdmGp
source: DDM GP
ru: РГМ (Глиссада)

# MeasureUnitsSettingsViewModelDdmGpDescription
source: Change the current measure units of DDM GP
ru: Измените текущие единицы измерения РГМ (Глиссада).

# BearingDegreeTitle
source: Degrees
ru: Градусы

# Temperature_Celsius_Title
source: Celsius
ru: Цельсий

# Temperature_Farenheit_Title
source: Farenheit
ru: Фаренгейт

# Temperature_Kelvin_Title
source: Kelvin
ru: Кельвин

# MeasureUnitsSettingsViewModelTemperature
source: Temperature
ru: Температура

# MeasureUnitsSettingsViewModelTemperatureDescription
source: Change the current measure units of temperature.
ru: Измените текущие единицы измерения температуры.

# AnchorMoverActionView_Title
source: Move anchors
ru: Переместить якоря

# MeasureUnitsSettingsViewModelAngle
source: Angle
ru: Угол

# MeasureUnitsSettingsViewModelAngleDescription
source: Change the current measure units of angle.
ru: Измените текущие единицы измерения угла.

# Degrees_Degree_Title
source: [D]°
ru: [Г]°

# Degrees_DMS_Title
source: [D]°[M]′[S]′′
ru: [Г]°[М]′[С]′′

# Latitude_Degree_Title
source: [D]°
ru: [Г]°

# Latitude_DMS_Title
source: [D]°[M]′[S]′′
ru: [Г]°[М]′[С]′′

# Longitude_DMS_Title
source: [D]°[M]′[S]′′
ru: [Г]°[М]′[С]′′

# Longitude_Degree_Title
source: [D]°
ru: [Г]°

# CoordinatesCalculatorDialog_Title
source: Coordinates calculator
ru: Калькулятор координат

# CoordinatesCalculatorDialog_CloseButton
source: Close
ru: Закрыть

# CoordinatesCalculatorView_ToStandard
source: To standard
ru: В стандарт

# CoordinatesCalculatorView_ToLongitude
source: To longitude
ru: В долготу

# CoordinatesCalculatorView_ToLatLonUnit
source: To lat/long units
ru: В единицы шир/долг

# CoordinatesCalculatorView_ToLatitude
source: To latitude
ru: В широту

# CoordinatesCalculatorView_ToAltUnit
source: To altitude units
ru: В единицы высоты

# CoordinatesCalculatorView_ToAltitude
source: To altitude
ru: В высоту

# CoordinatesCalculatorView_FromStandard
source: From standard
ru: Из стандарта

# CoordinatesCalculatorView_FromLongitude
source: From longitude
ru: Из долготы

# CoordinatesCalculatorView_FromLatLonUnit
source: From lat/long units
ru: Из единиц шир/долг

# CoordinatesCalculatorView_FromLatitude
source: From latitude
ru: Из широты

# CoordinatesCalculatorView_FromAltUnit
source: From altitude units
ru: Из единиц высоты

# CoordinatesCalculatorView_FromAltitude
source: From altitude
ru: Из высоты

# Altitude_Description
source: Altitude measure units
ru: Единицы измерения высоты

# Altitude_Title
source: Altitude
ru: Высота

# AmplitudeModulation_Description
source: Amplitude modulation measure units
ru: Единицы измерения амплитудной модуляции

# AmplitudeModulation_Title
source: AM
ru: АМ

# Bearing_Description
source: Bearing measure units
ru: Единицы измерения несущей

# Bearing_Title
source: Bearing
ru: Несущая

# Degrees_Description
source: Angle measure units
ru: Единицы измерения угла

# Degrees_Title
source: Angle
ru: Угол

# Distance_Description
source: Distance measure units
ru: Единицы измерения расстояния

# Distance_Title
source: Distance
ru: Расстояние

# Frequency_Title
source: Frequency
ru: Частота

# Frequency_Description
source: Frequency measure units
ru: Единицы измерения частоты

# Latitude_Description
source: Latitude measure units
ru: Единицы измерения широты

# Latitude_Title
source: Latitude
ru: Широта

# Longitude_Description
source: Longitude measure units
ru: Единицы измерения долготы

# Longitude_Title
source: Longitude
ru: Долгота

# Phase_Description
source: Phase measure units
ru: Единицы измерения фазы

# Phase_Title
source: Phase
ru: Фаза

# Power_Description
source: Power measure units
ru: Единицы измерения мощности

# Power_Title
source: Power
ru: Мощность

# TemperatureCelsius_ErrorMessage_NaN
source: Value must be a number
ru: Значение должно быть числом

# TemperatureFarenheit_ErrorMessage_NaN
source: Value must be a number
ru: Значение должно быть числом

# TemperatureCelsius_ErrorMessage_NullOrWhiteSpace
source: Value can't be null or white space
ru: Значение не должно быть пустым или пробелом

# TemperatureFarenheit_ErrorMessage_NullOrWhiteSpace
source: Value can't be null or white space
ru: Значение не должно быть пустым или пробелом

# Velocity_Description
source: Velocity measure units
ru: Единицы измерения скорости

# Velocity_Title
source: Velocity
ru: Скорость

# DdmGp_Title
source: DDM (Gp)
ru: РГМ (Gp)

# DdmGp_Description
source: Difference depth of modulation measure units
ru: Единицы измереня разницы в глубине модуляции

# DdmLlz_Title
source: DDM (Llz)
ru: РГМ (Llz)

# DdmLlz_Description
source: Difference depth of modulation measure units
ru: Единицы измереня разницы в глубине модуляции

# Sdm_Description
source: Sum depth of modulation measure units
ru: Единицы измерения суммы глубины модуляции

# HeaderTemplaterMenu_Header
source: Templater
ru: Шаблонизатор

# TemplaterDialog_CloseButton
source: Close
ru: Закрыть

# TemplaterDialog_SaveButton
source: Save
ru: Сохранить

# TemplaterView_TemplatePath
source: Template path:
ru: Путь к шаблону:

# TemplaterView_ResultPath
source: File path:
ru: Путь к файлу:

# TemplaterView_AddNewTag
source: Add new tag
ru: Добавить новый тег

# TemplaterView_AddImageTag
source: Add image tag
ru: Добавить тег картинки

# TemplaterView_AddStringTag
source: Add string tag
ru: Добавить строковый тег

# TemplaterView_ClearTagsList
source: Clear tags list
ru: Очистить список тегов

# Sdm_Title
source: SDM
ru: СГМ

# FieldStrength_Title
source: Field strength
ru: Напряжённость поля
