Repository: asv-soft/asv-drones
Catalog: src/Asv.Drones.Gui/RS.*.resx
Languages: ru

# LogViewerView_Threads
source: Threads
ru: Потоки

# LogViewerView_Classes
source: Classes
ru: Классы

# LogViewerView_Levels
source: Levels
ru: Уровни

# LogViewerView_SearchText_Watermark
source: Search in messages
ru: Поиск по сообщениям

# LogViewerView_StopDateTime_Title
source: Stop date time:
ru: Конечные время и дата:

# LogViewerView_StartDateTime_Title
source: Start date time:
ru: Начальные время и дата:

# LogViewerView_DataGrid_Time_Title
source: Time
ru: Время

# LogViewerView_DataGrid_ThreadId_Title
source: Thread ID
ru: ID Потока

# LogViewerView_DataGrid_Level_Title
source: Level
ru: Уровень

# LogViewerView_DataGrid_Class_Title
source: Class
ru: Класс

# LogViewerView_DataGrid_Message_Title
source: Message
ru: Сообщение

# LogViewerView_TextBlock_By_Title
source: By:
ru: По:

# LogViewerView_TextBlock_TotalItemsCount
source: Total: {0}
ru: Всего: {0}

# LogViewerView_TextBlock_FilteredItemsCount
source: Filtered: {0}
ru: Отфильтровано: {0}

# LogViewerView_TextBlock_PageItemsCount
source: On page: {0}
ru: На странице: {0}

# LogViewerViewModel_ClearDialog_Title
source: Log deletion
ru: Удаление журнала

# LogViewerViewModel_ClearDialog_Content
source: Are you sure you want to delete the log?
ru: Вы уверены что хотите удалить журнал?

# LogViewerViewModel_ClearDialog_PrimaryButton
source: Delete
ru: Удалить

# LogViewerViewModel_ClearDialog_CloseButton
source: Cancel
ru: Отмена

# AppearanceViewModel_CacheOnly_AccessMode
source: Cache only
ru: Только кэш

# AppearanceViewModel_ServerAndCache_AccessMode
source: Server and Cache
ru: Сервер и кэш

# AppearanceViewModel_ServerOnly_AccessMode
source: Server only
ru: Только сервер

# AppearanceView_MapAccess_Header
source: Map access
ru: Доступ к карте

# AppearanceView_MapAccess_Description
source: Select current map access mode
ru: Выбрать доступ к карте

# MissionStatusViewModel_PointLowerThanHome_Warning
source: Mission item '{0}' altitude is {1}. It is lower than Home altitude.
ru: У элемента миссии '{0}' высота {1}. Это ниже высоты стартовой точки.

# PluginsSourcesViewModel_AddNewSourceDialog_Title
source: Add new repository
ru: Добавить новый репозиторий

# PluginsSourcesViewModel_EditSourceDialog_Title
source: Edit repository
ru: Редактировать репозиторий

# PluginsSourcesViewModel_AddNewSourceDialog_CloseButton
source: Cancel
ru: Отмена

# PluginsSourcesViewModel_AddNewSourceDialog_PrimaryButton
source: Add
ru: Добавить

# PluginsSourcesViewModel_EditSourceDialog_PrimaryButton
source: Apply
ru: Применить

# PluginsSourcesViewModel_EditSourceDialog_CloseButton
source: Cancel
ru: Отмена

# PluginsSourcesView_AddNewSource
source: Add
ru: Добавить

# PluginsSourcesView_EditSource
source: Edit
ru: Редактировать

# PluginsSourcesView_RemoveSource
source: Delete
ru: Удалить

# PluginsSourcesView_DataGrid_Name
source: Name
ru: Имя

# PluginsSourcesView_DataGrid_URL
source: URL Address
ru: Адрес URL

# PluginsSourcesView_DataGrid_User
source: Username
ru: Имя пользователя

# PluginsSourcesView_DataGrid_Password
source: Password
ru: Пароль

# SourcesView_Password
source: New password
ru: Новый пароль

# SourcesView_Username
source: Username
ru: Имя пользователя

# SourcesView_URL
source: URL Address
ru: Адрес URL

# SourcesView_Name
source: Name
ru: Имя

# PluginsSourcesTreeMenuItem_Name
source: Sources
ru: Источники

# PluginsSourcesTreeMenuItem_Description
source: Edit plugins sources
ru: Редактирование источников плагинов

# PluginsTreeMenuItem_Name_Plugins
source: Plugins
ru: Плагины

# PluginsTreeMenuItem_Description
source: Plugin Management allows users to install, configure, update, and remove plugins to customize and enhance the functionality of their software application
ru: Управление плагинами позволяет пользователям устанавливать, настраивать, обновлять и удалять плагины для настройки и улучшения функциональности их программного обеспечения

# PluginsInstalledTreeMenuItem_Name
source: Installed
ru: Установленные

# PluginsInstalledTreeMenuItem_Description
source: Information about installed plugins
ru: Информация об установленных плагинах

# PluginsSourcesViewModel_PluginsSourcesViewModel_Error_to_update
source: Error to update plugin server list
ru: Ошибка обновления списка серверов плагина

# PluginsSourcesViewModel_PluginsSourcesViewModel_Error_to_remove
source: Error to remove plugin server
ru: Ошибка удаления сервера

# PluginsSourcesViewModel_AddImpl_Title
source: Add new plugin source
ru: Добавить новый сервер

# PluginsSourcesViewModel_AddImpl_Add
source: Add
ru: Добавить

# PluginsSourcesViewModel_AddImpl_Cancel
source: Cancel
ru: Отменить

# PluginsSourcesViewModel_EditImpl_Save
source: Save
ru: Сохранить

# PluginsSourcesViewModel_EditImpl_Title
source: Edit plugin source
ru: Редактриовать сервер

# PluginsSourcesView_AddSource
source: Add new source
ru: Добавить новый

# SourceViewModel_SourceViewModel_Name_is_required
source: Name is required
ru: Имя не должно быть пустым

# SourceViewModel_SourceViewModel_SourceUri_is_required
source: Server URI is required
ru: URI сервера не может быть пустым

# PluginsInstalledView_Search
source: Search
ru: Поиск

# PluginsInstalledView_Uninstalled
source: Uninstalled
ru: Удален

# PluginsInstalledView_LoadingError
source: Loading error
ru: Ошибка загрузки

# PluginsInstalledView_Uninstall
source: Uninstall
ru: Удалить

# PluginsInstalledView_UninstalledMessage
source: This plugin has been marked for deletion. It will be removed on the next application load.
ru: Этот плагин был отмечен для удаления. Он будет удален при следующей загрузке приложения.

# PluginsInstalledView_UninstalledMessageTitle
source: Uninstalled
ru: Удален

# PluginsInstalledView_CancelUninstall
source: Cancel
ru: Отменить

# PluginsInstalledView_Tab_Description
source: Description
ru: Описание

# PluginsInstalledView_Tab_AdditionalInfo
source: Additional info
ru: Дополнительно

# PluginsMarketView_Install
source: Install
ru: Установить

# PluginsMarketView_Cancel
source: Cancel
ru: Отмена

# PluginsSourcesViewModel_AddAction_Label
source: Add
ru: Добавить

# SelectUploadVehicleView_SelectVehicle_Title
source: Vehicle
ru: Аппарат

# SelectDownloadVehicleView_SelectVehicle_Title
source: Vehicle
ru: Аппарат

# SelectUploadVehicleView_VehicleLoadProgress_Text
source: Vehicle upload progress
ru: Прогресс загрузки на аппарат

# SelectUploadVehicleView_SelectVehicle_Placeholder
source: Select vehicle to upload
ru: Выберите аппарат для загрузки

# SelectDownloadVehicleView_CloseOnFinish_Text
source: Close dialog when download finish
ru: Закрыть диалог по завершению скачивания

# SelectUploadVehicleView_CloseOnFinish_Text
source: Close dialog when upload finish
ru: Закрыть диалог по завершению загрузки

# SelectDownloadVehicleView_VehicleLoadProgress_Text
source: Vehicle download progress
ru: Прогресс скачивания с аппарата

# SelectDownloadVehicleView_SelectVehicle_Placeholder
source: Select vehicle to download
ru: Выберите аппарат для скачивания

# PlaningMissionEditorViewModel_UploadDialog_Title
source: Select target to upload missions
ru: Выберите дрон для загрузки миссии

# PlaningMissionEditorViewModel_UploadDialog_PrimaryButtonText
source: Upload
ru: Загрузить

# PlaningMissionEditorViewModel_UploadDialog_SecondaryButtonText
source: Cancel
ru: Отмена

# PlaningMissionEditorViewModel_DownloadDialog_PrimaryButtonText
source: Download
ru: Скачать

# PlaningMissionEditorViewModel_DownloadDialog_SecondaryButtonText
source: Cancel
ru: Отмена

# PlaningMissionEditorViewModel_DownloadDialog_Title
source: Select target to download missions
ru: Выберите дрон для скачивания миссии

# SelectDownloadVehicleViewModel_SelectVehicle_ValidationMessage
source: Vehicle selection must be specified
ru: Должен быть определен выбранный аппарат

# SelectUploadVehicleViewModel_SelectVehicle_ValidationMessage
source: Vehicle selection must be specified
ru: Должен быть определен выбранный аппарат

# PlanningPageViewModel_MissionDownloaded
source: Mission downloaded!
ru: Миссия скачана!

# MissionStatusViewModel_FlightMissionTime_Minutes
source: min
ru: мин

# FlightUavViewModel_RtlCommand_Name
source: Return to Launch (RTL)
ru: Вернуться домой

# FlightUavViewModel_StartMissionCommand_Name
source: Start Mission
ru: Начать миссию

# FlightUavViewModel_TakeOffCommand_Name
source: Take Off
ru: Взлёт

# FlightUavViewModel_RoiCommand_Name
source: Set ROI
ru: Установить ROI

# ConsumedEnergyMahUavRttView_ToolTip
source: Consumed energy
ru: Количество потребленной энергии

# AddSourceView_Name
source: Name
ru: Имя

# VehiclesShellMenuItemProvider_ShellMenuItem_QuickSettings
source: Quick settings
ru: Быстрые настройки

# VehicleQuickParamPageViewModel_Title
source: Quick settings
ru: Быстрые настройки

# VehicleQuickParamStandardTreeMenuItem_Name
source: Standard params
ru: Стандартные параметры

# VehicleQuickParamStandardTreeMenuItem_Description
source: Here you can configure some of vehicle standard params.
ru: Здесь вы можете настроить некоторые параметры стандартные параметры устройства.

# VehicleQuickParamSliderViewModel_Range
source: Range: [{0}, {1}]
ru: Диапазон: [{0}, {1}]

# VehicleQuickParamSliderViewModel_Units
source: Units: [{0}]
ru: Единицы измерения: [{0}]

# VehicleQuickParamsStandardTreePage_Refresh
source: Refresh
ru: Обновить

# VehicleQuickParamsStandardTreePage_Write
source: Write
ru: Записать

# QuickParametersSliderView_IsDescrete
source: Descrete
ru: Дискретные

# PortViewModel_ValidPacketLossChance
source: Packet Loss Chance should be between 0 and 100 inclusive
ru: Шанс потери пакетов должен быть между 0 и 100 включительно

# PortView_PacketLossChance
source: Packet Loss Chance
ru: Шанс потери пакетов

# Accuracy_Description
source: Accuracy measure units
ru: Единицы измерения точности

# Accuracy_Meters_Title
source: Meters
ru: Метры

# Accuracy_Meters_Unit
source: m
ru: м

# Accuracy_NauticalMiles_Title
source: Nautical miles
ru: Морские мили

# Accuracy_Title
source: Accuracy
ru: Точность

# HeaderPlaningFileSaveAsMenuItem_Title
source: Save As...
ru: Сохранить как...

# PlanningPageViewModel_MissionSavingBrowserDialog_PrimaryButton
source: Save
ru: Сохранить

# PlanningPageViewModel_MissionSavingBrowserDialog_SecondaryButton
source: Cancel
ru: Отменить

# PlanningPageViewModel_MissionSavingBrowserDialog_Title
source: Chose the file name to save
ru: Выберите имя файла для сохранения

# PlanningPageViewModel_MissionSavingBrowserDialog_ConfirmationText_Title
source: Confirmation
ru: Подтверждение

source: Rewrite
ru: Перезаписать

# PlanningPageViewModel_MissionSavingBrowserDialog_ConfirmationText_ContentText
source: A file with the same name already exists. After performing this action, overwriting will occur. Are you sure you want to continue?
ru: Файл с таким именем уже существует. После выполнения данного действия произойдёт перезапись. Вы уверены, что хотите продолжить?
