Repository: asv-soft/asv-drones
Catalog: src/Asv.Drones.Gui/RS.*.resx
Languages: ru

# FieldStrength_Description
source: Field strength measure units
ru: Единицы измерения напряжённости поля

# FieldStrength_MicroVoltsPerMeter_Unit
source: µV/m
ru: мкВ/м

# Degrees_DM_Title
source: [D]°[M]′
ru: [Г]°[М]′

# MeasureUnitsSettingsViewModelBearing
source: Bearing
ru: Азимут

# MeasureUnitsSettingsViewModelBearingDescription
source: Change the current measure units of bearing.
ru: Измените текущие единицы измерения азимута.

# HeaderAnchorsMenu_Title
source: Anchors
ru: Якори

# ParametersEditorParameterView_PinToggleButton_ToolTip
source: On/off pin for this parameter
ru: Включить/выключить закрепление этого параметра

# ParametersEditorParameterView_UpdateButton_ToolTip
source: Update this parameter from UAV
ru: Обновить этот парметр из БПЛА

# ParametersEditorParameterView_WriteButton_ToolTip
source: Write this parameter to UAV
ru: Записать этот парметр в БПЛА

# ParametersEditorParameterView_RebootRequired
source: Reboot required
ru: Требуется перезагрузка

# ParametersEditorParameterView_UpdateButton
source: Update
ru: Обновить

# ParametersEditorParameterView_WriteButton
source: Write
ru: Записать

# ParamPageViewModel_DataLossDialog_CloseButtonText
source: Cancel
ru: Отмена

# ParamPageViewModel_DataLossDialog_Content
source: You're trying to open another menu folder, but you have unsaved changes in the current one. Do you want to save them?
ru: Вы пытаетесь открыть другой пункт меню, но в текущем у вас есть несохраненные изменения. Хотите сохранить их?

# ParamPageViewModel_DataLossDialog_PrimaryButtonText
source: Save
ru: Сохранить

# ParamPageViewModel_DataLossDialog_SecondaryButtonText
source: Don't save
ru: Не сохранять

# ParamPageViewModel_DataLossDialog_Title
source: Potential data loss warning
ru: Предупреждение о возможной потере данных

# ParametersEditorPageView_StarsToggleButton_ToolTip
source: Show only starred parameters
ru: Показать только избранные параметры

# ParametersEditorPageView_UpdateButton_ToolTip
source: Update all parameters
ru: Обновить все параметры

# ParametersEditorPageView_PinsOffButton_ToolTip
source: Remove all pinned parameters
ru: Убрать все прикреплённые параметры

# ParametersEditorPageView_StarButton_ToolTip
source: Star this parameter
ru: Добавить параметр в избранные

# ParametersEditorPageViewModel_Title
source: Parameters editor [{0}]
ru: Редактор параметров [{0}]

# ParametersEditorPageViewModel_Search
source: Search
ru: Найти

# ParametersEditorPageViewModel_Total
source: Total: {0}
ru: Всего: {0}

# MissionEditorView_Points_Title
source: Mission points
ru: Точки миссии

# HeaderPlaningFileMenuItem_Title
source: File
ru: Файл

# HeaderPlaningFileOpenMenuItem_Title
source: Open
ru: Открыть

# PlanningPageViewModel_MissionBrowserDialog_Title
source: Select mission file
ru: Выберите файл миссии

# PlanningPageViewModel_MissionBrowserDialog_PrimaryButton
source: Open
ru: Открыть

# PlanningPageViewModel_MissionBrowserDialog_SecondaryButton
source: Cancel
ru: Отмена

# HeaderPlaningFileDeleteMenuItem_Title
source: Delete
ru: Удалить

# HeaderPlaningFileDownloadMenuItem_Title
source: Download
ru: Скачать

# HeaderPlaningFileUploadMenuItem_Title
source: Upload
ru: Загрузить

# PlaningMissionViewModel_NameMustBeNotEmpty
source: Name must be not empty
ru: Имя не должно быть пустым

# HeaderPlaningFileSaveMenuItem_Title
source: Save
ru: Сохранить

# PlanningPageViewModel_MissionUploaded
source: Mission uploaded!
ru: Миссия загружена!

# PlaningMissionViewModel_SelectTargetLocation
source: Select target point location
ru: Укажите местоположение точки

# HierarhicalStoreView_Search_Textbox_Watermark
source: Search
ru: Поиск

# PacketViewerViewDockPanelText
source: Packet Viewer
ru: Просмотр пакетов

# PacketViewer_Expander_MessageSources
source: Message sources
ru: Источники сообщений

# PacketViewer_Expander_MessageTypes
source: Message types
ru: Типы сообщений

# HierarchicalStoreView_TextBlock_Text_MoveFolder
source: Move Folder
ru: Переместить папку

# HierarchicalStoreView_TextBlock_Text_MoveHere
source: Move Here
ru: Переместить сюда

# HierarchicalStoreView_TextBlock_Text_Cancel
source: Cancel
ru: Отмена

# AnchorsEditorView_TextBlock_Latitude_Text
source: Latitude
ru: Широта

# AnchorsEditorView_TextBlock_Altitude_Text
source: Altitude
ru: Высота

# AnchorsEditorView_TextBlock_Longitude_Text
source: Longitude
ru: Долгота

# PlaningMissionEditorViewModel_WaypointMenuItem_Title
source: Waypoint
ru: Путевая точка

# PlaningMissionEditorViewModel_TakeOffMenuItem_Title
source: Take off
ru: Взлёт

# PlaningMissionEditorViewModel_RoiMenuItem_Title
source: ROI
ru: Регион интересов

# PlaningMissionEditorViewModel_DoLandMenuItem_Title
source: Do land
ru: Посадка

# PlaningMissionEditorViewModel_ReplacePointFlyoutMenuItem
source: Replace
ru: Заменить

# PlaningMissionEditorViewModel_AddPointFlyoutMenuItem_Title
source: Add
ru: Добавить

# PlaningPageViewModel_DataLossDialog_PrimaryButtonText
source: Save
ru: Сохранить

# PlaningPageViewModel_DataLossDialog_SecondaryButtonText
source: Don't save
ru: Не сохранять

# PlaningPageViewModel_DataLossDialog_CloseButtonText
source: Cancel
ru: Отмена

# PlaningPageViewModel_DataLossDialog_Title
source: Potential data loss warning
ru: Предупреждение о возможной потере данных

# PlaningPageViewModel_DataLossDialog_Content
source: You're trying to open another menu folder, but you have unsaved changes in the current one. Do you want to save them?
ru: Вы пытаетесь открыть другой пункт меню, но в текущем у вас есть несохраненные изменения. Хотите сохранить их?

# ParametersEditorPageViewModel_Loaded
source: Loaded: {0}
ru: Получено: {0}

# DeviceBrowserTreeMenuItem_Description
source: List of all devices found on the MAVLink network
ru: Список всех устройств, найденных в сети MAVLink

# ConnectionTreeMenuItem_Description
source: Basic MAVLink connection settings
ru: Основные настройки подключения MAVLink

# DeviceBrowserView_EmptyText
source: The device list is empty. Try adding ports or checking connections.
ru: Список устройств пуст. Попробуйте добавить порты или проверьте соединения.

# MavlinkIdTreeMenuItem_Description
source: Configure MAVLink network settings for this application
ru: Настройте сетевые параметры MAVLink для этого приложения.

# RoiAnchor_Vehicle_Name
source: ROI of
ru: ROI от

# TakeOffAnchorActionViewModel_Title
source: Take off
ru: Взлёт

# TakeOffAnchorActionViewModel_DialogDescription
source: Set altitude above ground level (AGL) for takeoff command.
ru: Задайте высоту для взлёта относительно земли (AGL).

# TakeOffAnchorActionViewModel_DialogPrimaryButton
source: Take off
ru: Взлёт

# TakeOffAnchorActionViewModel_DialogSecondaryButton
source: Cancel
ru: Отмена

# TakeOffAnchorActionViewModel_ValidValue
source: Altitude must be greater or equal {0}.
ru: Высота должна быть больше или равна {0}.

# TakeOffAnchorActionViewModel_LogMessage
source: User send TakeOff at {0} altitude for {1}
ru: Пользователь отправил команду Взлёт на высоту {0} для {1}

# BatteryUavRttView_ToolTip
source: Battery level
ru: Заряд батареи

# UavAnchor_Latitude
source: Latitude: {0}
ru: Широта: {0}

# UavAnchor_Longitude
source: Longitude: {0}
ru: Долгота: {0}

# UavAnchor_GNSS_Altitude
source: GNSS Altitude: {0}
ru: Высота GNSS: {0}

# UavAnchor_AGL_Altitude
source: AGL Altitude: {0}
ru: Высота AGL: {0}

# RoiAnchor_Vehicle_Yaw_Sample_Description
source: Yaw angle
ru: Угол рыскания

# RoiAnchor_Vehicle_Yaw_Sample_Unit
source: deg
ru: град

# UavRttItem_ValueNotAvailable
source: N\A
ru: Н\Д

# CpuLoadUavRttView_ToolTip
source: CPU load of UAV
ru: Загрузка процессора БПЛА

# CurrentUavRttView_ToolTip
source: UAV current
ru: Ток БПЛА

# FlightTimeUavRttView_ToolTip
source: UAV time in flight
ru: Время полёта БПЛА

# HomeDistanceUavRttView_ToolTip
source: Distance from UAV to home
ru: Дистанция от БПЛА до дома

# LinkQualityUavRttView_ToolTip
source: UAV link quality
ru: Качество связи с БПЛА

# VoltageUavRttItemView_ToolTip
source: UAV voltage
ru: Напряжение БПЛА

# FlightUavView_MoveToButton_ToolTip
source: Move to this UAV on map
ru: Перейти к этому БПЛА на карте

# MissionStatusView_GetMissionButton_ToolTip
source: Load mission from UAV
ru: Загрузить миссию с БПЛА

# MissionStatusView_DisableLayersButton_ToolTip
source: Disables mission trajectory and waypoints visibility
ru: Выключает видимость траектории и точек миссии

# MissionStatusView_TogglePolygonButton_ToolTip
source: On/off mission trajectory visibility
ru: Включает/выключает видимость траектории миссии

# MissionStatusView_ToggleWaypointsButton_ToolTip
source: On/off mission way points visibility
ru: Включает/выключает видимость точек миссии

# MissionStatusView_MissionProgress_ToolTip
source: Current mission progress
ru: Текущий прогресс миссии

# AltitudeIndicator_Vibration_ToolTip
source: Vibration and clipping of UAV
ru: Вибрация и клиппинг БПЛА

# AttitudeIndicator_Velocity_ToolTip
source: Velocity
ru: Скорость

# AttitudeIndicator_Altitude_ToolTip
source: Altitude
ru: Высота

# AttitudeIndicator_Compass_ToolTip
source: Compass
ru: Компас

# FlightUavView_Minimize_ToolTip
source: Minimize/Maximize UAV
ru: Свернуть/Развернуть БПЛА

# FlightUavView_FollowButton_ToolTip
source: Follow/Unfollow UAV
ru: Следовать/Прекратить следование за БПЛА

# RebootAutopilotView_AutopilotReboot_Description
source: Choose Autopilot reboot/shutdown mode
ru: Выберите режим перезапуска/отключения автопилота

# RebootAutopilotView_CompanionReboot_Description
source: Choose companion reboot/shutdown mode
ru: Выберите режим перезапуска/отключения бортового компьютера

# RebootAutopilotAnchorActionViewModel_Title
source: Reboot/Shutdown
ru: Перезагрузить/Выключить

# RebootAutopilotAnchorActionViewModel_DialogPrimaryButton
source: Ok
ru: Ок

# RebootAutopilotAnchorActionViewModel_DialogSecondaryButton
source: Cancel
ru: Отмена

# RebootAutopilotAnchorActionViewModel_LogMessage
source: User sent Reboot Autopilot command with {0} and {1}
ru: Пользователь отправил комманду перезагрузки автопилота с параметрами {0} и {1}

# SelectModeAnchorActionViewModel_Title
source: Select UAV mode
ru: Режимы БПЛА

# SelectModeAnchorActionViewModel_DialogPrimaryButton
source: Ok
ru: Ок

# SelectModeAnchorActionViewModel_DialogSecondaryButton
source: Cancel
ru: Отмена

# SelectModeAnchorActionViewModel_LogMessage
source: User sent SetVehicleMode from {0} to {1}
ru: Пользователь отправил команду на изменение режима с {0} на {1}

# SelectModeAnchorActionView_DialogDescription
source: Change UAV mode from list
ru: Измените режим БПЛА на режим из списка

# SpeedsQuickParamView_WPNAV_SPEED_Header
source: Waypoint Horizontal Speed Target (WPNAV_SPEED)
ru: Целевая горизонтальная скорость путевой точки (WPNAV_SPEED)

# SpeedsQuickParamView_WPNAV_SPEED_Description
source: Defines the speed in cm/s which the aircraft will attempt to maintain horizontally during a WP mission. Increment - 0.5. Range 0.2-20. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Определяет скорость в см/с, которую дрон будет пытаться поддерживать в горизонтальном положении во время миссии WP. Шаг - 0.5. Диапазон 0.2-20. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_WPNAV_SPEED_DN_Header
source: Waypoint Descent Speed Target (WPNAV_SPEED_DN)
ru: Целевая скорость снижения по путевой точке (WPNAV_SPEED_DN)

# SpeedsQuickParamView_WPNAV_SPEED_DN_Description
source: Defines the speed in cm/s which the aircraft will attempt to maintain while descending during a WP mission. Increment - 0.1. Range 0.1-5. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Определяет скорость в см/с, которую дрон будет пытаться поддерживать при снижении во время миссии WP. Шаг - 0.1. Диапазон 0.1-5. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_WPNAV_SPEED_UP_Header
source: Waypoint Climb Speed Target (WPNAV_SPEED_UP)
ru: Целевая скорость набора высоты по путевой точке (WPNAV_SPEED_UP)

# SpeedsQuickParamView_WPNAV_SPEED_UP_Description
source: Defines the speed in cm/s which the aircraft will attempt to maintain while climbing during a WP mission. Increment - 0.5. Range 0.1-10. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Определяет скорость в см/с, которую дрон будет пытаться поддерживать при наборе высоты во время миссии WP. Шаг - 0.5. Диапазон 0.1-10. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_RTL_SPEED_Header
source: RTL speed (RTL_SPEED)
ru: Скорость RTL (RTL_SPEED)

# SpeedsQuickParamView_RTL_SPEED_Description
source: Defines the speed in cm/s which the aircraft will attempt to maintain horizontally while flying home. If this is set to zero, WPNAV_SPEED will be used instead. Increment - 50. Range 0-2000. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Определяет скорость в см/с, которую дрон будет поддерживать в горизонтальном положении при полете домой. Если установлено нулевое значение, вместо этого будет использоваться WPNAV_SPEED. Шаг - 50. Диапазон 0-2000. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_LOIT_SPEED_Header
source: Loiter Horizontal Maximum Speed (LOIT_SPEED)
ru: Горизонтальная максимальная скорость в режиме Loiter (LOIT_SPEED)

# SpeedsQuickParamView_LOIT_SPEED_Description
source: Defines the maximum speed in cm/s which the aircraft will travel horizontally while in loiter mode. Increment - 0.5. Range 0.2-35. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Определяет максимальную скорость в см/с, с которой дрон будет двигаться горизонтально в режиме Loiter. Шаг - 0.5. Диапазон 0.2-35. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_LAND_SPEED_Header
source: Land speed (LAND_SPEED)
ru: Скорость посадки (LAND_SPEED)

# SpeedsQuickParamView_LAND_SPEED_Description
source: The descent speed for the final stage of landing in cm/s. Increment - 0.1. Range 0.3-2. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Скорость снижения на конечном этапе приземления в см/с. Шаг - 0.1. Диапазон 0.3-2. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_LAND_SPEED_HIGH_Header
source: Land speed high (LAND_SPEED_HIGH)
ru: Высокая скорость посадки (LAND_SPEED_HIGH)

# SpeedsQuickParamView_LAND_SPEED_HIGH_Description
source: The descent speed for the first stage of landing in cm/s. If this is zero then WPNAV_SPEED_DN is used. Increment - 0.1. Range 0-5. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Скорость снижения на первом этапе приземления в см/с. Если это значение равно нулю, используется WPNAV_SPEED_DN. Шаг - 0.1. Диапазон 0-5. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_LAND_ALT_LOW_Header
source: Land altitude low (LAND_ALT_LOW)
ru: Низшая высота посадки (LAND_ALT_LOW)

# SpeedsQuickParamView_LAND_ALT_LOW_Description
source: Altitude during Landing at which vehicle slows to LAND_SPEED. Increment - 0.1. Range 1-100. [{0:F2} cm] [{1:F2} ft]. Note: This parameter is for advanced users.
ru: Высота при посадке, на которой транспортное средство замедляется до LAND_SPEED. Шаг - 0.1. Диапазон 1-100. [{0:F2} см] [{1:F2} фт]. Примечание. Этот параметр предназначен для опытных пользователей.

# SpeedsQuickParamView_PILOT_SPEED_UP_Header
source: Pilot maximum vertical speed ascending (PILOT_SPEED_UP)
ru: Максимальная вертикальная скорость пилота при наборе высоты (PILOT_SPEED_UP)

# SpeedsQuickParamView_PILOT_SPEED_UP_Description
source: The maximum vertical ascending velocity the pilot may request in cm/s. Increment - 0.1. Range 0.5-5. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Максимальная скорость вертикального набора высоты, которую может запросить пилот, в см/с. Шаг - 0.1. Диапазон 0.5-5. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_PILOT_SPEED_DN_Header
source: Pilot maximum vertical speed descending (PILOT_SPEED_DN)
ru: Максимальная вертикальная скорость пилота при снижении (PILOT_SPEED_DN)

# SpeedsQuickParamView_PILOT_SPEED_DN_Description
source: The maximum vertical descending velocity the pilot may request in cm/s. If 0 PILOT_SPEED_UP value is used. Increment - 0.1. Range 0-5. [{0:F2} cm/s] [{1:F2} km/h] [{2:F2} mi/h].
ru: Максимальная скорость вертикального снижения, которую может запросить пилот, в см/с. Если используется значение 0, то берётся значение PILOT_SPEED_UP. Шаг - 0.1. Диапазон 0-5. [{0:F2} см/с] [{1:F2} км/ч] [{2:F2} ми/ч].

# SpeedsQuickParamView_LAND_ALT_LOW_Units
source: m
ru: м

# SpeedsQuickParamView_WPNAV_SPEED_UP_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_WPNAV_SPEED_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_WPNAV_SPEED_DN_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_RTL_SPEED_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_PILOT_SPEED_UP_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_PILOT_SPEED_DN_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_LOIT_SPEED_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_LAND_SPEED_Units
source: m/s
ru: м/с

# SpeedsQuickParamView_LAND_SPEED_HIGH_Units
source: m/s
ru: м/с

# ControllerReloadQuickParamView_ReloadButton_Content
source: Reload
ru: Перезагрузить

# ControllerReloadQuickParamView_Header
source: Controller reload
ru: Перезагрузка контроллера

# ControllerReloadQuickParamView_Description
source: Here you can reload controller
ru: Здесь вы можете перезагрузить контроллер

# SpeedsQuickParamView_Header
source: Speeds
ru: Скорость

# SpeedsQuickParamView_Description
source: Here you can change the speeds
ru: Здесь вы можете изменить скорости

# IdentityQuickParamView_Header
source: System ID
ru: ID системы

# IdentityQuickParamView_Description
source: Each system has a network-unique system id, and each component has a system-unique component id that can be used for addressing/routing
ru: Каждая система имеет уникальный для сети идентификатор системы, и каждый компонент имеет уникальный для системы идентификатор компонента, который можно использовать для адресации/маршрутизации.

# FailSafeQuickParamView_Header
source: FailSafe parameters
ru: Параметры FailSafe

# FailSafeQuickParamView_Description
source: Here you can change FailSafe parameters
ru: Здесь вы можете изменить параметры FailSafe

# QuickParamsSetupPageView_WriteRequired_Title
source: Write required
ru: Требуется запись

# QuickParamsSetupPageView_WriteRequired_Message
source: You must click the write button if you want to save and apply the changes.
ru: Вы должны нажать кнопку записи, если хотите сохранить и применить изменения.

# QuickParamsSetupPageView_AdvancedSetupButton_Text
source: Advanced setup
ru: Расширенная настройка

# QuickParamsSetupPageView_ReadAllButton_Text
source: Read all
ru: Прочитать все

# QuickParamsSetupPageView_WriteAllButton_Text
source: Write all
ru: Записать все

# FlightUavView_UavDropDownControls_Title
source: Uav actions
ru: Действия с БПЛА

# FlightUavView_FindButton_ToolTip
source: Find UAV
ru: Найти БПЛА

# MissionStatusView_TotalDistance
source: Total: {0}
ru: Всего: {0}

# MissionStatusView_MissionDistance
source: Mission: {0}
ru: Миссия: {0}

# VehiclesShellMenuItemProvider_ShellMenuItem_Settings
source: Settings
ru: Настройки

# LandAnchorActionViewModel_Title
source: Immediately land
ru: Приземлиться

# GoToMapAnchorActionViewModel_Title
source: GoTo
ru: Перейти в точку

# GoToMapAnchorActionViewModel_ExecuteImpl_ShowTargetDialog_Value
source: Select target for GoTo action
ru: Выберите точку в которую нужно перейти

# GoToMapAnchorActionViewModel_ExecuteImpl_LogInfo_Value
source: User send GoTo '{0}' for {0}
ru: Пользователь отправил переход в точку {0} для {1}

# LandAnchorActionViewModel_ExecuteImpl_LogInfo
source: User send DoLand for {0}
ru: Пользователь отправил команду приземлиться для {0}

# RtlAnchorActionViewModel_RTL
source: Return to launch (RTL)
ru: Вернуться домой

# RtlAnchorActionViewModel_ExecuteImpl_LogInfo
source: User send Return To the Launch(RTL) for {0}
ru: Пользователь отправил команду вернуться в точку запуска для {0}

# RoiAnchorActionViewModel_Title
source: Set ROI
ru: Установить ROI

# RoiAnchorActionViewModel_ExecuteImpl_ShowTargetDialog_Value
source: Select target for region of interests (ROI)
ru: Выберите цель для назначения ROI

# RoiAnchorActionViewModel_ExecuteImpl_LogInfo
source: User set ROI '{0}' for {1}
ru: Пользователь назначил ROI '{0}' для {1}

# TakeOffAnchorActionViewModel_OnCommandError
source: Error to arm/disarm {0}
ru: Не получиось разблокировать/заблокировать двигатели {0}

# AttitudeViewModel_Vehicle_UpdateStatusText_Armed
source: Armed
ru: Разблокирован

# AttitudeViewModel_Vehicle_UpdateStatusText_Disarmed
source: Disarmed
ru: Заблокирован

# PlaningMissionViewModel_InternalAfterMapInit_Vehicle_Name_Subscribe
source: {0} mission
ru: Миссия БПЛА - {0}

# StartAutoAnchorActionViewModel_Title
source: Start mission
ru: Начать миссию

# StartAutoAnchorActionViewModel_ExecuteImpl_LogInfo
source: User send Start mission for {0}
ru: Пользователь отправил команду начать миссию для {0}

# PlaningMissionViewModel_OnDownloadError_LogInfo
source: Download mission error {0}
ru: Ошибка при загрузке миссии для {0}

# PlaningMissionViewModel_OnUploadError_LogInfo
source: Upload mission error {0}
ru: Ошибка при отправки мисси для {0}

# PlaningMissionViewModel_OnClearError_LogInfo
source: Clear mission error {0}
ru: Ошибка при удалении миссии для {0}

# PlaningMissionPointViewModel_Param1Title
source: Parameter 1
ru: Параметр 1

# PlaningMissionPointViewModel_Param2Title
source: Parameter 2
ru: Параметр 2

# PlaningMissionPointViewModel_Param3Title
source: Parameter 3
ru: Параметр 3

# PlaningMissionPointViewModel_Param4Title
source: Parameter 4
ru: Параметр 4

# PlaningMissionNavWaypointViewModel_Param1Title
source: Hold time
ru: Время удержания

# PlaningMissionNavWaypointViewModel_Param2Title
source: Acceptance radius
ru: Радиус принятия

# PlaningMissionNavWaypointViewModel_Param3Title
source: Pass Radius
ru: Радиус прохождения

# PlaningMissionNavWaypointViewModel_Param4Title
source: Yaw angle
ru: Угол рыскания

# PlaningMissionNavSplineWaypointViewModel_Param1Title
source: Hold time
ru: Время удержания

# PlaningMissionNavSplineWaypointViewModel_Param2Title
source: Empty
ru: Пустой

# PlaningMissionNavSplineWaypointViewModel_Param3Title
source: Empty
ru: Пустой

# PlaningMissionNavSplineWaypointViewModel_Param4Title
source: Empty
ru: Пустой

# PlaningMissionNavTakeoffViewModel_Param2Title
source: Empty
ru: Пустой

# PlaningMissionNavTakeoffViewModel_Param3Title
source: Empty
ru: Пустой

# PlaningMissionNavTakeoffViewModel_Param1Title
source: Pitch angle
ru: Угол наклона

# PlaningMissionNavTakeoffViewModel_Param4Title
source: Yaw angle
ru: Угол рыскания

# PlaningMissionNavLandViewModel_Param1Title
source: Abort altitude
ru: Высота отсечки

# PlaningMissionNavLandViewModel_Param2Title
source: Land mode
ru: Режим посадки

# PlaningMissionNavLandViewModel_Param3Title
source: Empty
ru: Пустой

# PlaningMissionNavLandViewModel_Param4Title
source: Yaw angle
ru: Угол рыскания

# PlaningMissionDoSetRoiViewModel_Param1Title
source: ROI mode
ru: Режим ROI

# PlaningMissionDoSetRoiViewModel_Param2Title
source: WP index/Target ID
ru: Индекс точки/ID цели

# PlaningMissionDoSetRoiViewModel_Param3Title
source: ROI Index
ru: Индекс точки ROI

# PlaningMissionDoSetRoiViewModel_Param4Title
source: Empty
ru: Пустой

# PlaningMissionDoChangeSpeedViewModel_Param4Title
source: Empty
ru: Пустой

# PlaningMissionDoChangeSpeedViewModel_Param2Title
source: Speed
ru: Скорость

# PlaningMissionDoChangeSpeedViewModel_Param1Title
source: Speed type
ru: Тип скорости

# PlaningMissionDoChangeSpeedViewModel_Param3Title
source: Throttle
ru: Мощность

# PlaningMissionEditorViewModel_DoSetRoiMenuItem_Title
source: ROI
ru: Регион интересов

# PlaningMissionEditorViewModel_DoChangeSpeedMenuItem_Title
source: Change speed
ru: Изменить скорость

# PlaningMissionEditorViewModel_NavSplineWaypointMenuItem_Title
source: Spline waypoint
ru: Сплайновая путевая точка

# LogViewer_Name
source: Log viewer
ru: Просмотр лога
